{
  "_name_or_path": "dslim/bert-base-NER",
  "_num_labels": 9,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-ORG",
    "4": "I-ORG",
    "5": "B-LOC",
    "6": "I-LOC",
    "7": "B-TIME_ANOMALY",
    "8": "I-TIME_ANOMALY",
    "9": "B-SENSITIVE_INFO",
    "10": "I-SENSITIVE_INFO",
    "11": "B-TECH_ASSET",
    "12": "I-TECH_ASSET",
    "13": "B-MEDICAL_CONDITION",
    "14": "I-MEDICAL_CONDITION",
    "15": "B-SUSPICIOUS_BEHAVIOR",
    "16": "I-SUSPICIOUS_BEHAVIOR",
    "17": "B-SENTIMENT_INDICATOR",
    "18": "I-SENTIMENT_INDICATOR"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-LOC": 5,
    "B-MEDICAL_CONDITION": 13,
    "B-ORG": 3,
    "B-PERSON": 1,
    "B-SENSITIVE_INFO": 9,
    "B-SENTIMENT_INDICATOR": 17,
    "B-SUSPICIOUS_BEHAVIOR": 15,
    "B-TECH_ASSET": 11,
    "B-TIME_ANOMALY": 7,
    "I-LOC": 6,
    "I-MEDICAL_CONDITION": 14,
    "I-ORG": 4,
    "I-PERSON": 2,
    "I-SENSITIVE_INFO": 10,
    "I-SENTIMENT_INDICATOR": 18,
    "I-SUSPICIOUS_BEHAVIOR": 16,
    "I-TECH_ASSET": 12,
    "I-TIME_ANOMALY": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
